{"pageProps":{"content":"\n<p style=\"text-align: center;\">The work of Quality Assurance professionals can often be intricate while being holistic at the same time. Hence it stands to reason that ensuring an effective start for a new employee is critical to their performance and the team's overall success. Although highly important, designing the onboarding process is not as intuitive.</p>\n\n## What NOT To Do\n### For QAs/Testers\n1. **DO NOT** ask them to **explore** the application for a few days to understand how it works. **WHY?**\n   1. Exploring an application is a time-consuming process with no measurable end results.\n   2. Often such an endless quest leads to differences in understanding of expectations from the applications.  \n   *Eg. For an e-commerce product you as QA Manager would expect the QA to focus on the product's checkout flow however a Tester with a background in mobile application testing might end up focusing on the navigations.\n   So at the end when you as Manager ask if the QA has understood the \"application\", although the answer would be yes, it would still mean different things for both of you.*\n   3. Sometimes limitations/known issues in the applications can confuse the QA/Tester thereby limiting their confidence in the application & further limit their ability to question things since they would not be sure if something is broken or an ***undocumented feature*** 😉\n2. **DO NOT** share tons of documentation to understand details. **WHY?**\n   1. As humans we can neither retain nor retrieve a lot of information in a short span of a few days. This will add enormous pressure on the new joiner while still resulting in inefficiencies at the end.\n   2. **Everyone hates it.** So just dont do it.\n3. **DO NOT** ask them to execute all the cases from the entire regression suite. **WHY?**\n   1. In effect, it will take forever to finish for a person with no prior knowledge of the product or processes.\n   2. Too much work pressure. Not needed right when someone joins. Have mercy!\n   3. Any occurrences of bugs will complicate and prolong the test.\n   4. Without prior experience with the application, the end result of the test will be less than satisfactory for both the manager and the individual.\n4. **DO NOT** make them work in isolation from other teams.\n   1. No matter how fast you need to get up and running with your work, they will always need to interact with people from other departments for gaining valuable knowledge. So make sure to introduce them to key people from other departments and enable them to collaborate.\n   2. Also introduce each person effectively and not just names and designations. **Pro tip: You need these people to remember each other.**\n   3. Sometimes companies assign a person from the team to handle introductions. However, in non-colocated teams, not many people know each other well and hence may not have the reach or the resources or rapport to make the introductions.\n\n### Additionally for Automation Engineers\n5. **DO NOT** share a bunch of test cases to automate right away. **WHY?**\n   1. Most often manual test cases are written from the perspective of a human, specifically a QA professional, and often need to be rewritten to make them work with automation.\n   2. However without prior experience of the applications and their processes it is very challenging to adapt test cases for automation.\n   3. Also driving test coverage without consulting the automation engineer with regards to scope & priority is like treating them as **Automation Printing Machines**, which they are not. You hired these smart individuals for a reason. Listen to them.\n6. **DO NOT** make them work on manual testing tasks for too long. **WHY?**\n   1. Test automation needs a certain set of skills, attitude & perspective which is different from manual testers(domain experts). Hence automation engineers could be less effective there.\n   2. While focusing on manual testing for too long, their automation skills could get rusty, which they will realize sooner or later and resent their work. If that continues, you could even lose them, and you don't want that!\n\n---\n\n    Now, if you're not following any of the practices above and want \n    to learn how to improve? \n    READ ON.  \n    \n    However if you're not doing anything for onboarding and making the person \n    start working right away? \n    DEFINITELY READ ON!!!\n\n## Designing the right onboarding process\nTo design the right onboarding process you need to understand its underlying driving forces which are the needs of the new joiner, the team & you as a leader.\n\n### For effective performance of the **new joiner**, they **need** to:\n1. Understand the product(s).\n2. Understand the process(es).\n3. Understand the team(s) & colleague(s).\n4. Understand culture.\n5. Understand expectation(s).\n\n### For a cohesive functioning of the **team**, they **need** to:  \n1. Understand how responsibilities will be shared within the team.\n2. Understand how to leverage the strengths & support the challenges of the new joiner.\n3. Most importantly the team needs to build [trust](#) amongst each other.\n\n### For clarity & confidence as a **Manager**, you **need** to:\n1. Understand if the newbie needs help in any areas at work.\n2. Make sure to iron out misalignments between job expectations (if any).\n3. Only spend optimum time or energy to manage the onboarding.\n4. Enable the newbie to perform at their best.\n5. Make sure the newbie does not quit in a few days. 😅\n\nAs you can see from the objectives above, most of them were missed by the processes mentioned in the DON'T section. I believe these objectives are self-explanatory however, should you have any challenges in understanding them, feel free to contact me.\n\nNow we will see how to effectively set up the process.\n## What To Do\n\n### For QA Engineers\n**1. Introduce the applications & platforms**\n   1. If a test suite exists already, scope out a few smoke tests (if not done already) and ask the QA to execute these tests on a the most important platfoms.\n   2. Then share a feature in the application for the QA to explore & write tests for it. If a test suite does not exist as per point#1, then priotise critical feature(s) for the QA to write tests for them.\n\n**2. Introduce the teams & processes**\n   1. Task the QA with **validating bug fixes** *(no more than 7-8 in a week)*. This way they will need to interact with the developers and other team members to undestand the tasks and build rapport while discussing processes.\n   2. Invite the newbies to **observe** a few **meetings** within & accross teams. This will also be a good experience for the new joiner to observe the **culture** in the teams and get comfortable.\n\n### Additionally For Automation Engineers\n**3. Assess capabilities & establish expectations**\n   1. Allow the engineer to create a sample framework for automation for a small use case (which is not automated till now), while following the coding standards *(eg. code styling, formatting, conventions etc.)* of the team.\n   2. Guide the new joiner to create a test capability matrix for their framework. If other frameworks are in use already, allow the newbie to comparatively analyse all these frameworks to understand possibilities of improvement in the team's processesing capabilities & possible pitfalls to watch out for in the future.\n\n## There you have it!\nOn finishing the above the new joiners will be acquainted with the products, processes & standards to follow and be enabled to perform at their best.","data":{"title":"Onboarding QAs & Automation Engineers","date":"2022-05-03","template":"post","draft":false,"slug":"qa-onboarding","category":"Test Management","tags":["Onboarding"],"description":"The most effective onboarding process for QA/Testers & Automation Engineers."}},"__N_SSG":true}